Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_+99 Reinforced Wooden Stick.tmx
Source language: en
Languages: es_419

source: judging by his appearance, he must be a total newbie.
es_419: Por su apariencia, debe ser un novato.

source: you’re really putting me in a bind here!
es_419: La verdad, ¡me pones en un aprieto!

source: shut up.{j}I got my character back thanks to him.
es_419: Cállate.{j}Recuperé mi personaje gracias a él.

source: ...I could end this copycat loser.
es_419: … de vencer a este imitador barato.

source: what was the point of that?
es_419: ¿Qué sentido tuvo eso?

source: but how are you still standing here unscathed?
es_419: Entonces, ¿cómo puede ser que estés ilesa?

source: that’s what’s strange about this.
es_419: Eso es lo extraño.

source: you’ll be taking the spotlight for the final performance!
es_419: ¡Tú serás quien cierre el evento!

source: thank you!
es_419: ¡Gracias!

source: you’re no fun.
es_419: Eres aburrido.

source: ...I nearly died of a heart attack.
es_419: … casi muero de un infarto.

source: 800,000 killed in first wave.
es_419: En la primera ola, murieron 800 000.

source: wa...
es_419: Espe…

source: sword skills available for use [1]
es_419: Habilidades de espada disponibles [1]

source: well, I’m leaving now!
es_419: Bueno, ¡ahora me voy!

source: [urus] shall have his revenge!{j}r{j}r{j}r{j}r{j}r{j}r
es_419: ¡[Urus] tendrá su venganza!

source: you look delicious.
es_419: … te ves deliciosa.

source: you! fighter! what kind of play was that?!
es_419: ¡Oye, luchadora! ¡¿Qué clase de táctica fue esa?!

source: it’s time to teach the rest of you a lesson...
es_419: Es hora de darles una lección…

source: but you...
es_419: Pero tú…

source: hidden job class, goddess of life
es_419: Clase oculta: Diosa de la vida

source: to forgive us...?
es_419: perdonarnos…?

source: how?!
es_419: ¡¿Cómo?!

source: oh, yeah.
es_419: Ah, sí.

source: have you forgotten your duties?!
es_419: ¡¿Olvidaste tus órdenes?!

source: ...you will now enter the ascended plane.
es_419: … entrarás al plano astral.

source: shake
es_419: SACUDE

source: but it looks like the heavens above are begging me to get my vengeance!
es_419: ¡Pero parece que alguien de arriba me ruega que busque venganza!

source: s-sir, we’ve got an emergency!
es_419: ¡S-señor, tenemos una emergencia!

source: wait, did you not advance job classes?
es_419: Un momento, ¿nunca avanzó de clase?

source: ...could kill a god?
es_419: … podría matar a una diosa?

source: strike without killing.
es_419: Golpear sin matar.

source: I didn’t want to play with him, but he wouldn’t stop bothering me.
es_419: No quería jugar con él, pero no dejaba de molestarme.

source: at the man leading the knights!
es_419: ¡A quien lidera a los caballeros!

source: well...
es_419: Bueno…

source: ?????? rank 1 of the hallasan guild’s four guardians spent 2.1 billion won
es_419: ¿¿¿??? Rango 1 de los cuatro guardianes del Gremio de Hallasan Gastó 2100 millones de wones

source: and of course...
es_419: Y por supuesto…

source: sacred guild
es_419: Gremio Sagrado

source: that’s pretty awesome.
es_419: Eso es impresionante.

source: my company is screwed.
es_419: Mi empresa está arruinada.

source: ...the big bang I was looking for.
es_419: … el final sorprendente que buscaba.

source: the 55,000 won...
es_419: ¿El paquete…

source: <this weapon cannot be repaired.>
es_419: <Esta arma no puede repararse>.

source: but in just a flash, I was making more than the top billionaires of the world.
es_419: Pero, en un instante, estaba ganando más que los millonarios más importantes del mundo.

source: m-my apologies!
es_419: ¡D-disculpas!

source: sarang uses games to relieve the stress from everyday life.
es_419: Sarang juega para aliviar el estrés de su vida diaria.

source: I’m the head of the design team.
es_419: Soy jefe del equipo de diseño.

source: I never thought we’d meet again in a place like this.
es_419: Nunca pensé que nos volveríamos a encontrar en un lugar como este.

source: but... you’ll find out soon enough.
es_419: Pero… te darás cuenta muy pronto…

source: excuse me!
es_419: ¡Disculpa!

source: so those guys from the hallasan guild...
es_419: Y esos tipos del Gremio de Hallasan…

source: how’ve you been?
es_419: ¿Cómo ha estado?

source: you will now receive exp for the battle.
es_419: Obtendrás experiencia por la pelea.

source: and each of these mirrors possess a different effect.
es_419: Y cada uno de ellos posee un efecto distinto.

source: how dare you make me wait for this long?
es_419: ¿Cómo te atreves a hacerme esperar tanto?

source: my grades aren’t great, nor am I good at sports.
es_419: Mis notas no son muy buenas ni soy hábil en los deportes.

source: look at him go.{j}rp
es_419: Miren cómo pelea.

source: hidden skill healing factor any amount of damage taken is instantly recovered. you are immune to status effects such as poison, ailments, and paralysis.
es_419: Habilidad oculta Factor de curación Te recuperas instantáneamente de cualquier cantidad de daño recibido. Eres inmune a los efectos temporarios de veneno, afecciones y parálisis.

source: save the people!
es_419: ¡Salven a la gente!

source: +5 leather glove of blood and iron
es_419: Guante de cuero “Sangre y hierro” +5

source: I’ll leave that to your imagination.
es_419: Lo dejo a tu imaginación.

source: Staff Rock LeeㆍBobaccari KongsunaㆍWallabyㆍBalkwang Beoseotㆍ3742
es_419: Equipo: Rock LeeㆍBobaccari KongsunaㆍWallabyㆍBalkwang Beoseotㆍ3742

source: what’s this all about?
es_419: ¿Qué pasó?

source: this broke loser only spend 100 million won.
es_419: Este pobre perdedor solo gastó 100 millones de wones.

source: your character has died.
es_419: Tu personaje ha muerto.

source: don’t you dare...
es_419: No te atrevas…

source: ...this is where my story really begins.
es_419: … es donde realmente empieza mi aventura.

source: it’s just you two left now.
es_419: Quedan ustedes dos nada más.

source: game companies: can’t catch hacker. also game companies: it’s not a hacker guys!!!
es_419: Las compañías de juegos: “No podemos atrapar al hacker”. También las compañías de juegos: “¡¡¡No es un hacker, chicos!!!”.

source: ugh, this is sad.
es_419: Agh, esto es muy triste.

source: I’ve never seen her around.
es_419: Jamás la había visto.

source: not only for the users of chrono life...
es_419: No solo entre los usuarios de Chrono Life…

source: you sure that guy who killed three million users wasn’t just a hacker?
es_419: ¿Están seguros de que el tipo que mató a tres millones de usuarios no era solo un hacker?

source: I’m sorry, everyone.
es_419: Perdón a todos.

source: b{j}r{j}r{j}r{j}r{j}r{j}r
es_419: Brrrrrrr

source: yep, that was me.
es_419: Sip, fui yo.

source: I was wondering where you went. you were in there the whole time?
es_419: Me preguntaba dónde estarías. ¿Estuviste ahí dentro todo el tiempo?

source: are those the guard knights of the royal palace?
es_419: ¿Son los caballeros del palacio real?

source: "prodigy."
es_419: “Un prodigio”.

source: pyuuu
es_419: PIUUU

source: whoa, did you just pop out of the weapon?
es_419: Guau, ¿acabas de salir del arma?

source: do you know what kind of trouble you could get into?!
es_419: ¡¿Sabes qué clase de problemas podrías tener?!

source: ooh...
es_419: Aah…

source: and she’s out!
es_419: ¡Quedó frita!

source: current number of online users:
es_419: Cantidad de usuarios en línea:

source: funny how things work out.
es_419: Es gracioso cómo se dan las cosas.

source: if I’m going to put on this secretly op act, I need to act like a newbie!
es_419: Si voy a ocultar esto de ser SP, ¡tengo que actuar como un novato!

source: CON constitution this stat affects your maximum hp and hp regeneration. this stat also grants you immunity to status effects.
es_419: CON Constitución Esta característica modifica el total de tus puntos de salud y su regeneración. Además, te otorga inmunidad a los efectos temporarios.

source: that’s equal to ten million won* in real life!
es_419: ¡Eso equivale a diez millones de wones* en la vida real!

source: welcome, human child.
es_419: Bienvenido, niño humano.

source: with a huge reward like this, the entire userbase is going to come for you.
es_419: Con una recompensa tan grande como esta, todos los usuarios vendrán a buscarlo.

source: hidden skill healing factor effect activated
es_419: Habilidad oculta Factor de curación activado

source: you have angered the god of classes.
es_419: Has hecho enojar al Dios de las Clases.

source: rumble...
es_419: BRUUUM…

source: is this some surprise in-game event?!
es_419: ¡¿Es algún evento sorpresa del juego?!

source: s{j}w{j}o{j}o{j}s{j}h
es_419: SWOOSH

source: any amount of damage taken is instantly recovered.
es_419: Te recuperas instantáneamente de cualquier cantidad de daño recibido.

source: did I snatch her up too hard?
es_419: ¿La capturé con demasiada fuerza?

source: episode.
es_419: Episodio:

source: the next door neighbor gave it to me.
es_419: Me lo dio el vecino.

source: oh... okay. good night.
es_419: Ah… bueno. Buenas noches.

source: but then again, as a pro, it’s my responsibility to help out the new players!
es_419: Pero, bueno, como pro que soy, ¡es mi responsabilidad ayudar a los nuevos!

source: whatever.
es_419: Como sea.

source: freedom, huh?
es_419: Libertad, ¿eh?

source: shut up!
es_419: ¡Cállate!

source: not only did you advance to a hidden class.
es_419: No solo avanzó a una clase oculta,

source: I’ve decided that we won’t interfere with the users any longer.
es_419: No vamos a interferir más entre los usuarios.

source: there we go.
es_419: Muy bien.

source: hidden skill [healing factor] has been activated.
es_419: La habilidad oculta [Factor de curación] ha sido activada.

source: how brave of you, mere mortal...
es_419: Qué valiente eres, mortal…

source: thank you.
es_419: Gracias.

source: wh-what the hell is this?!
es_419: ¡¿Q-Qué rayos es esto?!

source: yeah, it’s already past midnight.
es_419: Sí, ya es pasada la medianoche.

source: I guess I should get going soon too.
es_419: Creo que yo también debería irme.

source: I don’t even know what you’re talking about, old man.
es_419: No sé de qué hablas, viejo.

source: these hallasan guild people picked a fight with luv.
es_419: Los del Gremio de Hallasan buscan pelea con Amor.

source: but they’re all just old men, so they suck at the actual controls of the game. that’s why I always win!
es_419: Pero son gente grande, así que no manejan bien los controles del juego. ¡Por eso gano siempre!

source: what news?
es_419: ¿De qué?

source: huh? why?
es_419: ¿Eh? ¿Por qué?

source: just as I expected of my child.
es_419: No esperaba menos de mi hijo.

source: or at least that’s what the company wants to do.
es_419: O, al menos, eso es lo que la empresa quiere hacer.

source: 3,000,000 killed in second wave.
es_419: En la segunda, murieron 3 000 000.

source: slaying 800,000 people in just one swing?!
es_419: ¡¿Mató a 800 000 jugadores de un solo golpe?!

source: now, go!
es_419: ¡Ahora, ve!

source: you lowly human! how dare you?!
es_419: ¡Humano despreciable! ¡¿Cómo te atreves?!

source: +99 wooden stick rank: ego
es_419: Palo de madera +99 Ranking: Ego

source: you smell just like me.
es_419: Hueles igual que yo.

source: but that was still pretty interesting to watch.
es_419: Pero igual fue algo muy interesante de ver.

source: he...
es_419: Él…

source: I’m going to actually swing with all of my power this time.
es_419: Esta vez voy a golpear con toda mi fuerza.

source: ...beginner warrior...
es_419: … de guerrero principiante…

source: now that she’s got her guard down, make your move.
es_419: Ahora que está distraída, haz lo tuyo.

source: they’re all old linnagers.
es_419: Son viejos Linnagers.

source: I’ll be taking her for now!
es_419: ¡Me la llevaré un rato!

source: o-of course I am!
es_419: P-pero ¡claro que sí!

source: delicious!
es_419: ¡Exquisito!

source: ooh, really?
es_419: Ah, ¿en serio?

source: yet...
es_419: Pero…

source: undies is the only person who calls me that.
es_419: Calzón es el único que me llama así.

source: ...they just evaporated without a trace.
es_419: … se hubieran evaporado sin dejar rastro.

source: that’s the most powerful mage of the royal family, and leader of the holy land guild.
es_419: Esa es la maga más poderosa de la familia real y líder del Gremio Tierra Santa.

source: we’re just in the middle of the--
es_419: Estamos en medio del…

source: this is where my story really begins.
es_419: Aquí es donde realmente empieza mi aventura.

source: anyway, sarang,
es_419: En fin, Sarang,

source: at that point...
es_419: A esta altura…

source: since when was there a monster like this on the starting hills?
es_419: ¿Desde cuándo hay monstruos así en la zona inicial?

source: I’m... not sure.
es_419: No… no estoy seguro.

source: ...I’m sorry.
es_419: Lo siento.

source: you dodged all of my regular attacks...
es_419: Esquivaste todos mis ataques simples…

source: you need to think bigger.
es_419: Debes pensar en grande.

source: your efforts are futile.
es_419: Tus intentos son inútiles.

source: aghhhh!
es_419: ¡Aaaagh!

source: what kind of practice?
es_419: ¿Practicar qué cosa?

source: ...had crossed the line.
es_419: … sobrepasaron todos los límites.

source: you now own all of the [weapons of the ascended].
es_419: Ahora posees todas las [armas de los Ascendidos].

source: "sir?"
es_419: ¿”Señor”?

source: and I’m usually either reading poetry,
es_419: Y, por lo general, leo poesía…

source: look! the feedback forum is going wild!
es_419: ¡Miren! ¡El foro de comentarios está que arde!

source: all right, all right!
es_419: ¡Bueno, está bien!

source: how about you start paying attention to the people around you for once?
es_419: ¿No crees que ya es hora de que le prestes atención a la gente que te rodea?

source: I got scared because I thought you were a mob!
es_419: ¡Me asusté porque pensé que eran de la mafia!

source: she went on music shows, talk shows, variety shows...
es_419: Se presentó en programas musicales, de entrevistas, de variedades…

source: what the hell? that went from zero to a hundred real quick.
es_419: ¿Qué rayos? Eso pasó de cero a cien muy rápido.

source: I think that’ll be what it takes to make a clean split into two.
es_419: Creo que así realmente se partirá en dos.

source: in-game
es_419: EN EL JUEGO

source: +99 reinforced wooden stick
es_419: Palo de madera +99

source: that one reflects all physical and magic damage.
es_419: Ese refleja todo daño físico y mágico.

source: the soul of the [arrow] has entered your body.
es_419: El alma de [la flecha] ha entrado en tu cuerpo.

source: we’ve got the highest viewer ratings of all time!
es_419: ¡Tenemos el mayor índice de audiencia de todos los tiempos!

source: ...we cross paths again.
es_419: … nos volvemos a encontrar.

source: and this is what everyone referred to this day as.
es_419: Y así es como todos se referían a ese día…

source: shudder
es_419: TIEMBLA

source: your character is completely screwed!
es_419: ¡Su personaje está completamente arruinado!

source: this looks delicious!
es_419: ¡Se ve delicioso!

source: what’s going on here?
es_419: ¿Qué está pasando aquí?

source: not to mention, I saw that you customized* your character to look exactly like you!
es_419: ¡Y ni hablar de que vi que personalizaste* tu personaje para que sea igualito a ti!

source: did you just hit me?
es_419: ¿Me golpeaste?

source: if you join, we could become the top guild!
es_419: ¡Si te unes, podríamos ser el mejor gremio!

source: and the newest phone.
es_419: y el celular más moderno.

source: what a coincidence.
es_419: Qué casualidad.

source: I totally forgot...
es_419: Me olvidé por completo…

source: what’s this wall in the middle of the village?
es_419: ¿Qué hace esta pared en medio de la aldea?

source: where am I?
es_419: ¿Dónde estoy?

source: looks like your character respawned!
es_419: ¡Parece que tu personaje revivió!

source: ha... hahaha... wh-what do you mea--
es_419: Ja… ja, ja, ja… ¿Qué quieres decir…?

source: I spent a ton on in-app purchases.
es_419: Gasté una fortuna en la aplicación.

source: it was you who annihilated all of the members of the top five guilds.
es_419: Fuiste tú el que aniquiló a todos los miembros de los cinco mejores gremios.

source: our mage is down!
es_419: ¡La maga también cayó!

source: however, in the realms of virtual reality, the government has placed a policy where your character’s appearance must reflect your actual appearance.
es_419: Sin embargo, en el ámbito de la realidad virtual, el gobierno ha establecido una política según la cual la apariencia de tu personaje debe reflejar tu aspecto real.

source: now that I think about it, I still don’t know your name.
es_419: Ahora que lo pienso, aún no sé tu nombre.

source: I’m logging out!
es_419: ¡Me voy a desconectar!

source: seasoned player
es_419: Jugador experimentado

source: k{j}y{j}a{j}a{j}a{j}a
es_419: ¡Aaaaah!

source: don’t bring my parents into this, you jerk.
es_419: No metas a mis padres en esto, imbécil.

source: urus, what’s going on here?
es_419: Urus, ¿qué está pasando aquí?

source: I am urakan...
es_419: Soy Urakan…

source: then your weapon would become sentient...
es_419: Entonces, su arma se volvería sensitiva…

source: from this moment on, we’re giving up on that.
es_419: A partir de este momento, abandonamos eso.

source: ...I continued to age.
es_419: … fui creciendo.

source: wait...{j}I thought she was a newbie.
es_419: Espera… Pensé que era una novata.

source: no, for real.
es_419: No, en serio.

source: [luv] has invited you to their party.
es_419: [Amor] te invita a unirte a su grupo.

source: many years passed.
es_419: Pasaron muchos años.

source: the old lady here who runs this place cooks a mean bowl of soup!
es_419: ¡La anciana que maneja este lugar prepara buenas sopas!

source: you will now advance to a "hidden class".
es_419: Ahora avanzarás a una clase oculta.

source: hehe.
es_419: Je, je.

source: they’re game users who use billions of won on the game.
es_419: Son jugadores que gastan miles de millones de wones en el juego.

source: client ready.
es_419: Cliente listo.

source: are you blind or what?!
es_419: ¡¿Eres ciega o qué?!

source: ugh, it’s going to take forever to get there. what a hassle.
es_419: Agh, tardaré una eternidad en llegar allí. Qué fastidio.

source: n-not at all!
es_419: ¡P-para nada!

source: the soul of the [spear] has entered your body.
es_419: El alma de [la lanza] ha entrado en tu cuerpo.

source: he’s back to his original state.
es_419: Volvió a su estado original.

source: [hidden skill] acquired!
es_419: ¡[Habilidad oculta] adquirida!

source: how did you get in here?
es_419: ¿Cómo entraste?

source: our guilds shall band together...
es_419: Nuestros gremios se unirán…

source: but I’m so glad I can actually see you through this virtual reality world.
es_419: Pero me alegra mucho poder verte a través de este mundo de realidad virtual.

source: I’ve never had something so delectable!
es_419: ¡Jamás había comido algo tan sabroso!

source: the heart wrenching lyrics of your hit song, "mermaid's tale" has left such an impact.
es_419: La letra desgarradora de tu canción más exitosa, "El cuento de la sirena", ha causado una gran impresión.

source: why’d I have to be born poor?
es_419: ¿Por qué tuve que nacer pobre?

source: he’s clearly just some poor newbie.
es_419: Claramente es un pobre novato.

source: ahh, so you do want to die.
es_419: Ahh, así que quieres morir.

source: that’s weird.
es_419: Qué raro.

source: I’ll be back in about 30 minutes.
es_419: Volveré en 30 minutos.

source: why did he do that?
es_419: ¿Por qué hizo eso?

source: I told you, I’d never farm with a noob like you!
es_419: Ya te dije, ¡jamás haría un grupo con un novato como tú!

source: you’re so right. no one could have the stats or abilities to take on that many at once.
es_419: Tienes razón. Nadie podría tener las características y habilidades para hacer eso.

source: everyone’s still staring at you, though.
es_419: Igual todos lo siguen mirando.

source: how could you call someone as pretty as me a roach?
es_419: ¿Cómo puedes decirle cucaracha a alguien tan linda como yo?

source: but how are we supposed to believe that?
es_419: Pero ¿piensan que vamos a creer eso?

source: heh
es_419: JE

source: trillions?
es_419: ¿Billones?

source: are preparations going well?
es_419: ¿Los preparativos van bien?

source: it’s almost completely broken.
es_419: Está casi roto del todo.

source: now hand over those weapons and f*ck off.
es_419: Ahora, dame esas armas y vete a la m*erda.

source: I don’t need them!
es_419: ¡No los necesito!

source: mmm...
es_419: ¡Gah!

source: countless swords and spears sprawled across the land.
es_419: Hay innumerables lanzas y espadas desparramadas por todos lados.

source: I’ve got something to give you.
es_419: Tengo algo para darte.

source: wretch
es_419: BLAAJ

source: "the grave of all mortals".
es_419: “La tumba de todos los mortales”.

source: that’s not supposed to me, is it?
es_419: Supongo que ese no soy yo, ¿no?

source: urus, the ultimate dragon boss, wishes to relinquish his soul to you.
es_419: Urus, el enemigo final, desea encomendarte su alma.

source: since it’s just the first day of farming, let’s take it slow.
es_419: Como recién es el primer día de juntar objetos, voy a tomármelo con calma.

source: it’s easy to say.
es_419: Es fácil de decir.

source: I definitely felt myself swallowing her.
es_419: Sin duda sentí que la absorbía.

source: str required for equipment 30
es_419: Fuerza requerida 30

source: rub
es_419: RUS

source: I'll just call you "undies".
es_419: Te llamaré “Calzón”.

source: th-then, wanting to farm together was a lie too?
es_419: E-entonces, ¿eso de hacer un grupo era mentira también?

source: there’s a bugged item in our game, and we’re here to take it away.
es_419: Hay un objeto con un error en nuestro juego, y estamos aquí para sacarlo.

source: why are you so shocked?
es_419: ¿Por qué te sorprende tanto?

source: and of course, we have been receiving endless complaints at our support center. which means we will need to create another department to take on all of these complaints.
es_419: Y, por supuesto, hemos estado recibiendo un sinfín de quejas en nuestro centro de atención, por lo que tendremos que crear otro departamento que se encargue de todas esas quejas.

source: then does that mean the chrono life servers are down?
es_419: ¿Quiere decir que se cayeron los servidores de Chrono Life?

source: hawkeye went live recently.
es_419: Hawkeye hizo un stream en vivo hace poco.

source: when that time comes...
es_419: Cuando llegue ese momento…

source: holy land guild
es_419: Gremio Tierra Santa

source: wait, but I thought he killed other players too? you guys switch up real fast.
es_419: Esperen, pero ¿no mató a otros jugadores también? Ustedes cambian muy rápido.

source: even as the strongest boss monster in the game, I couldn’t take on thousands of enemies at once.
es_419: Incluso siendo el enemigo final del juego, yo no podía enfrentarme a miles de enemigos a la vez.

source: it’s habaek’s fourth mirror skill.
es_419: Es la habilidad del cuarto espejo de Habaek.

source: what the heck?
es_419: ¿Qué demonios?

source: you have reached the highest level of reinforcement for this item!
es_419: ¡Has llegado al máximo nivel de mejora de este objeto!

source: what’d you just say?
es_419: ¿Qué dijiste?

source: why should I have to hide my identity?!
es_419: ¡¿Por qué debería esconder mi identidad?!

source: hey, urus.
es_419: Oye, Urus.

source: since I’m a pro and all.
es_419: ya que soy una pro y todo eso.

source: only the best!
es_419: ¡Solo lo mejor!

source: how do you know that?
es_419: ¿Cómo lo sabes?

source: I did it!
es_419: ¡Lo hice!

source: but, of course.
es_419: Claro que sí.
